# Brewfile
# Ride or Die OpenGolf local development setup for macOS / Apple Silicon

tap "anomalyco/tap"

brew "git"
brew "gh"
brew "jq"
brew "direnv"
brew "node"
brew "pnpm"
brew "postgresql@16", restart_service: true
brew "uv"
brew "opencode"

cask "visual-studio-code"

vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "prisma.prisma"
vscode "editorconfig.editorconfig"
vscode "bradlc.vscode-tailwindcss"
vscode "ms-azuretools.vscode-docker"
vscode "github.vscode-pull-request-github"
